{
  "id": "c7ver9z38vjo",
  "favourite": true,
  "title": "Risk to renters as buy-to-let lending predicted to fall",
  "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/57e1/live/0dc80490-bb98-11ef-acfc-7396dc948a8a.jpg.webp",
  "publicationDate": "2024-12-12 10:01:01",
  "content": "A forecast fall in lending to landlords could squeeze the number of homes available to rent next year. \n Mortgage lenders' trade body UK Finance said the outlook was \"challenging\" for the buy-to-let sector in 2025 owing to extra taxes facing landlords.\n This is despite predictions that interest rates and, in turn, mortgage rates are expected to fall during the year.\n Tenants have faced intense pressure in recent years due to soaring rents and competition for available properties. \nForecasts for 2025 \n Falling mortgage rates in the second half of this year had led to a \"modest recovery\" in the buy-to-let sector this year following a tough 2023, according to UK Finance. \n But, in its latest annual forecast, external, it said extra stamp duty on the purchase of additional homes, as well as existing regulation and taxes would see activity shrink.\n It has predicted a 7% drop in mortgage lending for buy-to-let purchases in 2025 compared with this year. \n The National Residential Landlords Association (NRLA) has said that 31% of landlords are planning to sell properties they rent out in the next two years, because of extra cost pressures.\n Line chart showing year-on-year changes in average rent for new lets in the UK from October 2014 to October 2024, according to Zoopla. Rents rose by 3.9% in the year to October 2014. They fell to a low of 0.5% in mid-2017, and then rose again to around 2% in late-2019, before falling to an annual decrease of 1.6% in early-2021. They climbed again from there, peaking at 12.3% in the year to August 2022, before gradually falling to 3.9% in the year to October 2024. \n Property portal Zoopla said the average cost of renting was now £1,270 a month, which was £270 per month more expensive than at the end of the coronavirus pandemic. \n Generation Rent, which lobbies on behalf of renters, said that more breathing space should be given to tenants facing cost-of-living pressures. \n However, the pace of rent rises has slowed as many hit an affordability limit.\n Options for first-time buyers \n People stuck renting when they want to buy a first home may be offered some hope in the latest forecasts. \n Falls in mortgage rates and rising wages improved affordability for those buying a home late this year, and UK Finance expected this to continue into 2025. \n It has forecast a 10% rise in mortgage lending for house purchases next year, although some analysts have already questioned this prediction as optimistic for lenders.\n The latest data shows the average rate on a two-year fixed rate mortgage is 5.47%, according to financial information service Moneyfacts. A typical rate on a five-year deal is 5.25%. \n The Nationwide, the UK's biggest building society, said stamp duty changes for many buyers in England and Northern Ireland could create a volatile housing market in the first half of 2025.\n Further ahead, UK Finance said it expected many people to again find it tough to afford to move or buy a new home in 2026."
}
