{
    "id": "c0ewlxvlw81o",
    "favourite": true,
    "title": "Tourists in Fiji ill after suspected pina-colada poisoning",
    "image": "apps/backend/data/fiji-hotel.webp",
    "publicationDate": "2024-12-12 10:01:01",
    "content": "Seven foreigners in Fiji were sent to hospital for suspected poisoning after drinking pina coladas at a five-star resort's bar, local authorities said.\n\nFive are tourists, with one from the US and the rest from Australia, aged between 18 and 56. Two others are foreigners living in Fiji, according to local media reports citing the health ministry.\n\nSome were previously reported to be seriously ill, but local officials said on Monday that their symptoms have since improved and some were set to be discharged.\n\nThe incident comes weeks after the deaths of six tourists in the South East Asian nation of Laos because of suspected methanol poisoning.\n\nFiji tourism chief Brent Hill told RNZ they were keenly aware of the Laos incident, but added that the case in Fiji was \"a long way from that\".\n\nShortly after drinking the rum cocktail at the Warwick Fiji resort on the Coral Coast, the seven guests displayed nausea, vomiting and neurological symptoms.\n\nThey were initially taken to Sigatoka Hospital, and later transferred to Lautoka Hospital, according to the Fiji Times.\n\nFiji's tourism minister Viliame Gavok has stressed that this was an \"extremely isolated incident\" and that the resort claimed \"they have not engaged in practices such as substituting ingredients or altering the quality of drinks served to guests\".\n\nInitial investigations are under way and no further cases have been reported, authorities said.\n\nClear waters off the beach of Fiji's Coral Coast \nImage source,Getty Images\nImage caption,\nA file picture of Fiji's Coral Coast\n\nSydney resident David Sandoe told the Australian Broadcasting Corporation (ABC) that his daughter Tanya and granddaughter Georgia were among those affected. But he added they were returning home and doing \"very well\" considering what happened.\n\n\"It's very difficult to take a call at 11 at night... and your daughter says that they have been poisoned and they're in hospital,\" Mr Sandoe said, adding that Georgia had suffered a seizure.\n\nThe ABC had previously reported a 56-year-old Australian woman was under medical surveillance in hospital and a 19-year-old Australian woman had suffered \"serious medical episodes\".\n\nThe Warwick Fiji hotel said in a statement to the BBC that it was aware of the \"suspected alcohol poisoning\" and was taking it \"very seriously\". The hotel said it was \"conducting a thorough investigation\" while awaiting a \"test result report\" from the health authorities to \"gather all necessary information\".\n\nFiji police are said to be investigating the circumstances of the incident.\n\nTwo Australian families in Fiji are receiving consular assistance, an Australian foreign ministry spokesperson told the BBC.\n\nA New Zealand foreign affairs ministry spokesperson told the BBC it had \"not received any requests for assistance\" after the apparent poisoning incident.\n\nThe BBC also understands that no British persons were affected in the incident.\n\n\"There's a real terrifying sense of deja vu,\" Australian minister Jason Clare told the ABC. Two 19-year-old Australian girls had died from suspected methanol poisoning in the Laos incident.\n\nTourists have been advised to \"be alert to the potential risks around drink spiking and methanol poisoning through consuming alcoholic drinks in Fiji\" by Australia's Department of Foreign Affairs and Trade (DFAT).\n\nThe guidance said tourists should \"get urgent medical help if you suspect drink spiking\"."
}
